{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"<S>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<E>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"<P>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<UNK>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":{"type":"Sequence","normalizers":[{"type":"Lowercase"}]},"pre_tokenizer":{"type":"Split","pattern":{"String":" "},"behavior":"Isolated","invert":false},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<S>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"<E>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"<E>":{"id":"<E>","ids":[1],"tokens":["<E>"]},"<S>":{"id":"<S>","ids":[0],"tokens":["<S>"]}}},"decoder":{"type":"BPEDecoder","suffix":"</w>"},"model":{"type":"BPE","dropout":null,"unk_token":"<UNK>","continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<S>":0,"<E>":1,"<P>":2,"<UNK>":3," ":4,",":5,".":6,"0":7,"1":8,"2":9,"3":10,"4":11,"5":12,"6":13,"7":14,"8":15,"9":16,"a":17,"b":18,"c":19,"d":20,"e":21,"f":22,"g":23,"h":24,"i":25,"j":26,"k":27,"l":28,"m":29,"n":30,"o":31,"p":32,"q":33,"r":34,"s":35,"t":36,"u":37,"v":38,"w":39,"x":40,"y":41,"z":42},"merges":[]}}